tasks_c_sharp = {
    1:
        '1)Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.   Пример: a = 5; b = 7 -> max = 7a = 2 b = 10 -> max = 10a = -9 b = -3 -> max = -3',
    2:
        '2)Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.Пример: 2, 3, 7 -> 744 5 78 -> 7822 3 9 -> 22',
    3:
        '3)Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).   Пример: 4 -> да-3 -> нет7 -> нет',
    4:
        "4)Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.   Пример: 5 -> 2, 48 -> 2, 4, 6, 8",
    5:
        '5)Задача 7 HARD по желанию - идет за 2 обязательных Напишите программу, которая принимает на вход целое число любой разрядности и на выходе показывает третью цифру слева этого числа или говорит, что такой цифры нет. Через строку решать нельзя.    Пример: 456111 -> 678 -> нет  9146548 -> 43 -> нет',
    6:
        '1) Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа. Через строку решать нельзя.   Пример: 456 -> 5, 782 -> 8, 918 -> 1',
    7:
        "2) Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.Через строку решать нельзя.   Пример: 645 -> 5, 78 -> третьей цифры нет, 32679 -> 6",
    8:
        "3) Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.    Пример:6 -> да,7 -> да, 1 -> нет",
    9:
        "4) Задача необязательная 1: на входе целое или вещественное число, надо удалить вторую цифру слева этого числа. Пример: 145 -> 15, 1 -> нет, 567,123 -> 57,123",
    10:
        "5) Задача необязательная 2:В институте биоинформатики по офису передвигается робот. Недавно студенты из группы программистов написали для него программу, по которой робот, когда заходит в комнату, считает количество программистов в ней и произносит его вслух: <n программистов>.Для того, чтобы это звучало правильно, для каждого n нужно использовать верное окончание слова.Напишите программу, считывающую с пользовательского ввода целое число n (неотрицательное), выводящее это число в консоль вместе с правильным образом изменённым словом <программист>, для того, чтобы робот мог нормально общаться с людьми, например: 1 программист, 2 программиста, 5 программистов.В комнате может быть очень много программистов. Проверьте, что ваша программа правильно обработает все случаи, как минимум до 1000 человек.",
    11:
        "1) Задача 19: Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом. Через строку решать нельзя. Пример: 14212 -> нет, 12821 -> да, 23432 -> да",
    12:
        "2) Задача 21: Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве. Пример: A (3,6,8); B (2,1,-7), -> 15.84, A (7,-5, 0); B (1,-1,9) -> 11.53",
    13:
        "3) Задача 23: Напишите программу, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N. Пример: 3 -> 1, 8, 275 -> 1, 8, 27, 64, 125",
    14:
        "4) Задача 21 - HARD необязательная: Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в N-мерном пространстве. Сначала задается N с клавиатуры, потом задаются координаты точек",
    15:
        "5) Задача 19 - HARD необязательная: Напишите программу, которая принимает на вход целое число любой разрядности и проверяет, является ли оно палиндромом. Через строку нельзя решать само собой.",
    16:
       "1) Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B. Пример: 3, 5 -> 243 (3⁵)",
    17:
       "2) Задача 27: Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе. Пример: 452 -> 11, 82 -> 10, 9012 -> 12",
    18:
        "3) Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран. Пример: 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19], 6, 1, 33 -> [6, 1, 33]",
    19:
       "4) Задача 26 HARD Напишите программу, которая принимает на вход целое или дробное число и выдаёт количество цифр в числе.456 -> 3, 0 -> 1, 89,126 -> 5,0,001->4",
    20:
       "1)Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами. Напишите программу, которая покажет количество чётных чисел в массиве.  Пример: [345, 897, 568, 234] -> 2",
    21:
        "2)Задача 36: Задайте одномерный массив, заполненный случайными числами. Найдите сумму элементов, стоящих на нечётных индексах.  Пример: [3, 7, 23, 12] -> 19,[-4, -6, 89, 6] -> 0",
    22:
        "3)Задача 38: Задайте массив вещественных случайных чисел. Найдите разницу между максимальным и минимальным элементов массива.",
    23:
        "4)Задача HARD STAT необязательная: Задайте массив случайных целых чисел. Найдите максимальный элемент и его индекс, минимальный элемент и его индекс, среднее арифметическое всех элементов. Сохранить эту инфу в отдельный массив и вывести на экран с пояснениями. Найти медианное значение первоначалального массива , возможно придется кое-что для этого дополнительно выполнить.",
    24:
        "1)Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь. Пример: 0, 7, 8, -2, -2 -> 2, 1, -7, 567, 89, 223-> 3",
    25:
        "2)Задача 43: Напишите программу, которая найдёт точку пересечения двух прямых, заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; значения b1, k1, b2 и k2 задаются пользователем.   Пример: b1 = 2, k1 = 5, b2 = 4, k2 = 9 -> (-0,5; -0,5)",
    26:
        "3)Задача НЕГАФИБОНАЧЧИ необязательная. Задайте число. Составьте массив чисел НегаФибоначчи, в том числе для отрицательных индексов. Пример: для k = 9 массив будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]",
    27:
        "4)Задача VERY HARD необязательная Имеется массив случайных целых чисел. Создайте массив, в который попадают числа, описывающие максимальную сплошную возрастающую последовательность. Порядок элементов менять нельзя.Одно число - это не последовательность.    Пример:[1, 5, 2, 3, 4, 6, 1, 7] => [1, 7] так как здесь вразброс присутствуют все числа от 1 до 7,[1, 5, 2, 3, 4, 1, 7, 8 , 15 , 1 ] => [1, 5] так как здесь есть числа от 1 до 5 и эта последовательность длиннее чем от 7 до 8,[1, 5, 3, 4, 1, 7, 8 , 15 , 1 ] => [3, 5] так как здесь есть числа от 3 до 5 и эта последовательность длиннее чем от 7 до 8",
    28:
        "1)Задача 47. Задайте двумерный массив размером m×n, заполненный случайными вещественными числами. Пример: m = 3, n = 4. 0,5 7 -2 -0,     2, 1 -3,3 8 -9,9,       8 7,8 -7,1 9",
    29:
        "2)Задача 50. Напишите программу, которая на вход принимает значение элемента в двумерном массиве, и возвращает позицию этого элемента или же указание, что такого элемента нет.Например, задан массив: 1 4 7 2, 5 9 2 3, 8 4 2 4, 17 -> такого числа в массиве нет",
    30:
        "3)Задача 52. Задайте двумерный массив из целых чисел. Найдите среднее арифметическое элементов в каждом столбце.Например, задан массив:1 4 7 2,  5 9 2 3,    8 4 2 4.    Среднее арифметическое каждого столбца: 4,6; 5,6; 3,6; 3.",
    31:
        "1)Задача 54: Задайте двумерный массив. Напишите программу, которая упорядочит по убыванию элементы каждой строки двумерного массива.Например, задан массив: 1 4 7 2     5 9 2 3      8 4 2 4     В итоге получается вот такой массив:7 4 2 1     9 5 3 2     8 4 4 2",
    32:
        "2) Задача 56: Задайте прямоугольный двумерный массив. Напишите программу, которая будет находить строку с наименьшей суммой элементов.Например, задан массив: 1 4 7 2     5 9 2 3    8 4 2 4     5 2 6 7  Программа считает сумму элементов в каждой строке и выдаёт номер строки с наименьшей суммой элементов: 1 строка",
    33:
        "3)Задача 58: Задайте две матрицы. Напишите программу, которая будет находить произведение двух матриц.Например, даны 2 матрицы: 2 4 | 3 4     3 2 | 3 3   Результирующая матрица будет:18 20     15 18",
    34:
        "4)Задача 60. ...Сформируйте трёхмерный массив из неповторяющихся двузначных чисел. Напишите программу, которая будет построчно выводить массив, добавляя индексы каждого элемента.",
    35:
        "5)Задача 62. Напишите программу, которая заполнит спирально массив 4 на 4.",
    36: 
        "1)Задача 64: Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии",
    37:
        "2)Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.",
    38:
        "3)Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n."
 }
