easy = {
    1:
        '1)Напишите программу, которая выводит "Hello, World!" на экран',
    2:
        '2)Напишите программу, которая запрашивает у пользователя его имя и выводит приветственное сообщение с использованием этого имени',
    3:
        '3)Напишите программу, которая считает сумму двух чисел, введенных пользователем, и выводит результат на экран',
    4:
        '4)Напишите программу, которая определяет, является ли введенное число четным или нечетным.',
    5:

        '5)Напишите программу, которая находит наибольшее число из трех введенных пользователем чисел.',
    6:
        '6)Напишите программу, которая проверяет, является ли введенная строка палиндромом (читается одинаково слева направо и справа налево).',
    7:
        '7)Напишите программу, которая выводит таблицу умножения для заданного числа.',
    8:
        '8)Напишите программу, которая преобразует температуру из градусов Цельсия в градусы Фаренгейта или наоборот.',
    9:
        '9)Напишите программу, которая считает факториал заданного числа.',
    10:
        '10)Напишите программу, которая находит все простые числа в заданном диапазоне.'
}