medium = {
1:
'Задача: Найти сумму всех чисел в заданном списке.'
'Пример: Входной список - [1, 2, 3, 4, 5], Сумма - 15',
2:
'Задача: Проверить, является ли заданное число простым (имеет только два делителя: 1 и само число).'
'Пример: Входное число - 7, Результат - True',
3:
'Задача: Отсортировать заданный список чисел в порядке возрастания.'
'Пример: Входной список - [5, 2, 7, 1, 9], Отсортированный список - [1, 2, 5, 7, 9]',
4:
'Задача: Проверить, является ли заданная строка палиндромом (читается одинаково в обоих направлениях).'
'Пример: Входная строка - "radar", Результат - True',
5:
'Задача: Найти наибольший общий делитель (НОД) двух чисел.'
'Пример: Входные числа - 36 и 48, НОД - 12',
6:
'Задача: Подсчитать количество вхождений каждого элемента в заданном списке.'
'Пример: Входной список - [1, 2, 2, 3, 3, 3], Результат - {1: 1, 2: 2, 3: 3}',
7:
'Задача: Проверить, является ли заданное число факториалом другого числа.'
'Пример: Входные числа - 6 и 720, Результат - True',
8:
'Задача: Проверить, является ли заданная строка анаграммой другой строки (состоит из тех же символов, но в другом порядке).'
'Пример: Входные строки - "listen" и "silent", Результат - True',
9:
'Задача: Проверить, является ли заданный список палиндромом (читается одинаково в обоих направлениях).'
'Пример: Входной список - [1, 2, 3, 2, 1], Результат - True',
10:
'Задача: Найти среднее арифметическое всех чисел в заданном списке.'
'Пример: Входной список - [4, 6, 8], Среднее арифметическое - 6',
}